src/Catalogs/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказы</name>
  <comment>Поставленные Заказы (по флотам РФ и по Заказчикам)</comment>
  <owners>Catalog.ПроектыКораблей</owners>
  <attributes>
    <name>БортовойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Флоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостройки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Строитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТехническиеХарактеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиКораблей</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вооружение</name>
    <attributes>
      <name>Вооружение</name>
      <type>
        <types>CatalogRef.ВооружениеКораблей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ЗаказыПрисоединенныеФайлы/ЗаказыПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаказыПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <predefined>
    <items>
      <name>АдминистраторИССЗИПЭ</name>
      <description>Администратор ИСС ЗИП-Э</description>
    </items>
    <items>
      <name>ОтветственныйЗаКонтрольИсполнения</name>
      <description>Координатор выполнения задач</description>
    </items>
    <items>
      <name>ФС_ВТС_ОтветственныйЗаРегистрацияЗаявки</name>
      <description>Ответственный за регистрация заявки (ФС ВТС)</description>
    </items>
    <items>
      <name>ОтветственныйЗаСтруктуруКорабля</name>
      <description>Ответственный за структуру корабля</description>
    </items>
    <items>
      <name>ПредставительДЗО</name>
      <description>Представитель ДЗО</description>
    </items>
    <items>
      <name>РуководительДепартаментаВТС</name>
      <description>Руководитель ДВТС</description>
    </items>
    <items>
      <name>РуководительПроектаВТС</name>
      <description>Руководитель проекта ВТС</description>
    </items>
    <items>
      <name>РуководительПроектаЗИПЭ</name>
      <description>Руководитель проекта ИСС ЗИП-Э</description>
    </items>
    <items>
      <name>ФС_ВТС_РуководительРегиональногоОтдела</name>
      <description>Руководитель регионального отдела (ФС ВТС)</description>
    </items>
    <items>
      <name>ФС_ВТС_СогласующийРаспрелелениеЗаявки</name>
      <description>Согласующий распрелеление заявки (ФС ВТС)</description>
    </items>
    <items>
      <name>СпециалистДепартаментаЭкономики</name>
      <description>Специалист департамента экономики</description>
    </items>
    <items>
      <name>СпециалистПоВедениюБДЗИПЭ</name>
      <description>Специалист по ведению БД ИСС ЗИП-Э</description>
    </items>
    <items>
      <name>ФС_ВТС_Эксперт</name>
      <description>Эксперт (ФС ВТС)</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользуетсяБезОбъектовАдресации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСОбъектамиАдресации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыДополнительногоОбъектаАдресации</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыОсновногоОбъектаАдресации</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяРоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначение</name>
    <attributes>
      <name>ТипПользователей</name>
      <type>
        <types>DefinedType.Пользователь</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Заказы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		ЗаполнитьИзображения();
		
		//+ 21.03.2017 13:48:40 Савинов Александр Задача: ОПЗ 2
		
		ЗаполнитьПроектанта();
		
		//- 21.03.2017 13:48:45 Савинов Александр Задача: ОПЗ 2
	
	КонецЕсли;
	
	//++ 13.03.2018 Веденеев П. //отключение непосредственного изменения данных
	КорректировкаДанныхСправочников.ОтключитьНепосредственноеИзменениеДанных(ЭтаФорма);
	
	//++ 15.03.2018 Веденеев П. //старт бизнес-процесса на редактирование структуры корабля
	// ++ 27.06.2018 17:10:10 Базунов Д.А. Задача: 
	// Добавил "РуководительПроектаДепартаментаВТС"
	// -- 27.06.2018 17:10:10 Базунов Д.А. Задача:
	Элементы.ФормаОтправитьНаРедактированиеСтруктуры.Видимость = РольДоступна("РуководительДепартаментаВТС") Или РольДоступна("РуководительПроектаДепартаментаВТС") или РольДоступна("ПолныеПрава");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзображения()

	МассивРасширенийКартинок = Новый Массив;
	МассивРасширенийКартинок.Добавить("bmp");
	МассивРасширенийКартинок.Добавить("dib");
	МассивРасширенийКартинок.Добавить("rle");
	МассивРасширенийКартинок.Добавить("gif");
	МассивРасширенийКартинок.Добавить("jpg");
	МассивРасширенийКартинок.Добавить("jpeg");
	МассивРасширенийКартинок.Добавить("png");
	МассивРасширенийКартинок.Добавить("tif");
	МассивРасширенийКартинок.Добавить("ico");
	МассивРасширенийКартинок.Добавить("wmf");
	МассивРасширенийКартинок.Добавить("emf");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрисоединенныеФайлы.Ссылка
	|ИЗ
	|	Справочник.ЗаказыПрисоединенныеФайлы КАК ПрисоединенныеФайлы
	|ГДЕ
	|	ПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И ПрисоединенныеФайлы.Расширение В (&МассивРасширенийКартинок)";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	Запрос.УстановитьПараметр("МассивРасширенийКартинок", МассивРасширенийКартинок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;	
	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Изображения.Добавить(ПрисоединенныеФайлы.ПолучитьДанныеФайла(Выборка.Ссылка, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла);	
		
		КоличествоИзображений = КоличествоИзображений + 1;
	
	КонецЦикла;
	
	АдресКартинки = Изображения.Получить(0).Значение;
	
	Элементы.СледующееИзображение.Доступность = КоличествоИзображений > 1;
	
	НомерТекущегоИзображения = 0;

КонецПроцедуры // ЗаполнитьИзображения()

&НаСервере
Процедура ВывестиИзображенияНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
	     Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	МассивРасширенийКартинок = Новый Массив;
	МассивРасширенийКартинок.Добавить("bmp");
	МассивРасширенийКартинок.Добавить("dib");
	МассивРасширенийКартинок.Добавить("rle");
	МассивРасширенийКартинок.Добавить("gif");
	МассивРасширенийКартинок.Добавить("jpg");
	МассивРасширенийКартинок.Добавить("jpeg");
	МассивРасширенийКартинок.Добавить("png");
	МассивРасширенийКартинок.Добавить("tif");
	МассивРасширенийКартинок.Добавить("ico");
	МассивРасширенийКартинок.Добавить("wmf");
	МассивРасширенийКартинок.Добавить("emf");
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрисоединенныеФайлы.Ссылка
		|ИЗ
		|	Справочник.ЗаказыПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|ГДЕ
		|	ПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И ПрисоединенныеФайлы.Расширение В (&МассивРасширенийКартинок)";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	Запрос.УстановитьПараметр("МассивРасширенийКартинок", МассивРасширенийКартинок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЭтаФорма.АдресКартинки = ПрисоединенныеФайлы.ПолучитьДанныеФайла(Выборка.Ссылка).СсылкаНаДвоичныеДанныеФайла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВывестиИзображения()
	ВывестиИзображенияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ПодключитьОбработчикОжидания("ВывестиИзображения",0.1,Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Заказы.Ссылка,
	//	|	Заказы.Наименование,
	//	|	Заказы.БортовойНомер,
	//	|	Заказы.ЗаводскойНомер
	//	|ИЗ
	//	|	Справочник.Заказы КАК Заказы
	//	|ГДЕ
	//	|	(Заказы.БортовойНомер = &БортовойНомер И &БортовойНомер <> """"
	//	|	ИЛИ Заказы.ЗаводскойНомер = &ЗаводскойНомер И &ЗаводскойНомер <> """")
	//	|	И Заказы.Ссылка <> &Ссылка";
	//
	//Запрос.УстановитьПараметр("БортовойНомер", СокрЛП(ТекущийОбъект.БортовойНомер));
	//Запрос.УстановитьПараметр("ЗаводскойНомер", СокрЛП(ТекущийОбъект.ЗаводскойНомер));
	//Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда
	//
	//	Сообщить("Уже имеются другие заказы с одинаковыми бортовыми или заводскими номерами:",СтатусСообщения.Информация);
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//	
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "" + Выборка.Наименование + ", боротовой номер: " + Выборка.БортовойНомер + ", заводской номер: " + Выборка.ЗаводскойНомер;
	//		Сообщение.УстановитьДанные(Выборка.Ссылка.ПолучитьОбъект());
	//		Сообщение.Сообщить(); 
	//	
	//	КонецЦикла; 
	//	
	//	//Сообщить("Элемент не записан!",СтатусСообщения.Важное);
	//	//Отказ = Истина;
	//
	//КонецЕсли;
	
	//++ 13.03.2018 Веденеев П. //отключение непосредственного изменения данных
	Если ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыДляКорректировкиСправочников") И КоманднаяПанель.ПодчиненныеЭлементы.ФормаОбщаяКомандаАкцептоватьИзмененияВСправочнике.Видимость Тогда
	
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущееИзображение(Команда)
	
	НомерТекущегоИзображения = НомерТекущегоИзображения - 1;
	
	АдресКартинки = Изображения.Получить(НомерТекущегоИзображения).Значение;
	
	Элементы.ПредыдущееИзображение.Доступность = НомерТекущегоИзображения > 0;
	Элементы.СледующееИзображение.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СледующееИзображение(Команда)
	
	НомерТекущегоИзображения = НомерТекущегоИзображения + 1;
	
	АдресКартинки = Изображения.Получить(НомерТекущегоИзображения).Значение;
	
	Элементы.ПредыдущееИзображение.Доступность = Истина;
	Элементы.СледующееИзображение.Доступность = КоличествоИзображений > НомерТекущегоИзображения + 1;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроектанта()

	Проектант = ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(Объект.Владелец, "Проектант");	

КонецПроцедуры // ЗаполнитьПроектанта()

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ЗаполнитьПроектанта();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВооружениеВооружениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Вооружение.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = ПолучитьЗначениеРеквизита(ТекущиеДанные.Вооружение, "ЕдиницаИзмерения");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции

//++ 15.03.2018 Веденеев П. //старт бизнес-процесса на редактирование структуры корабля
&НаКлиенте
Процедура ОтправитьНаРедактированиеСтруктуры(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПоказатьПредупреждение(, "Сначала нужно записать элемент!");
		Возврат;
		
	КонецЕсли;
	
	Если КорректировкаДанныхСправочников.КорабльНаходитсяВПроцессеРедактирования(Объект.Ссылка, Истина) Тогда
		
		ПоказатьПредупреждение(, "Структура корабля уже находится в процессе редактирования!");
		Возврат;
		
	КонецЕсли;
	
	ДанныеБизнесПроцесса = ПолучитьСтруктуруДанныхБизнесПроцесса(Объект.Ссылка);
	
	ОткрытьФорму("БизнесПроцесс.РедактированиеЭлектроннойСтруктурыКорабля.Форма.ФормаБизнесПроцесса", 
		Новый Структура("ДанныеБизнесПроцесса", ДанныеБизнесПроцесса));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДанныхБизнесПроцесса(Знач Ссылка);
	
	СтруктураДанныхБизнесПроцесса = Новый Структура;
	
	СтруктураДанныхБизнесПроцесса.Вставить("Наименование", "Корректировка структуры корабля " + Ссылка.Наименование);
	СтруктураДанныхБизнесПроцесса.Вставить("Важность", Перечисления.ВариантыВажностиЗадачи.Обычная);
	СтруктураДанныхБизнесПроцесса.Вставить("Дата", ТекущаяДата());
	СтруктураДанныхБизнесПроцесса.Вставить("Автор", ПараметрыСеанса.ТекущийПользователь);
	СтруктураДанныхБизнесПроцесса.Вставить("АвторСтрокой", Строка(СтруктураДанныхБизнесПроцесса.Автор));
	СтруктураДанныхБизнесПроцесса.Вставить("Исполнитель", Справочники.РолиИсполнителей.ОтветственныйЗаСтруктуруКорабля);
	СтруктураДанныхБизнесПроцесса.Вставить("Предмет", Ссылка);
	СтруктураДанныхБизнесПроцесса.Вставить("Содержание", "Корректировка структуры комплектующих изделий и ЗИП корабля");
	СтруктураДанныхБизнесПроцесса.Вставить("НаПроверке", Ложь);
	СтруктураДанныхБизнесПроцесса.Вставить("Проверяющий", Неопределено);
	
	Возврат СтруктураДанныхБизнесПроцесса;
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//++ 13.03.2018 Веденеев П. //отключение непосредственного изменения данных
	КорректировкаДанныхСправочников.ОтключитьНепосредственноеИзменениеДанных(ЭтаФорма);
	
КонецПроцедуры
//-- 15.03.2018 Веденеев П. //старт бизнес-процесса на редактирование структуры корабля
